import sqlite3

class BaseData:

    activeMembers = {

    }

#-------------------------------------------------------------------------------------------------------------------------------------------------#

    MainText = """{0}, рад тебя видеть. 

У нас тут конкурс. 
Разыгрываем Qredo токены в количестве 500 штук🔥

Оценочная стоимость более 500 QREDO (примерно 1500$)🔥

Условия: 
 1. Быть подписанными на Qredo Russian (https://t.me/Qredo_Russian)
 2. Создать Qredo Fund (https://t.me/Qredo_Russian/6084) и указать в боте Wallet code
 3. Пригласить людей по реферальной ссылке.
 """

 #-------------------------------------------------------------------------------------------------------------------------------------------------#

    ValidText = """Введите свой Wallet Сode из Qredo Fund 

На скриншоте, Вы можете увидеть, где находится Wallet Code 

Если у Вас все еще нет Qredo Fund, (https://t.me/Qredo_Russian/6084) создайте его следуя - ИНСТРУКЦИИ (https://t.me/Qredo_Russian/6084)"""

#-------------------------------------------------------------------------------------------------------------------------------------------------#

    ReffLink = """Поздравляем, вы участвуете в Air Drop!🔥"""

#-------------------------------------------------------------------------------------------------------------------------------------------------#


    def __init__(self, db_name):
        self.connection = sqlite3.connect(db_name)
        self.curson = self.connection.cursor()
    def sql(self, sql):
        with self.connection:
            return self.curson.execute(sql).fetchall()